tap "hashicorp/tap"
tap "starkandwayne/cf"
brew "ast-grep"
brew "openssl@3"
brew "awscli"
brew "bat"
brew "bitwarden-cli"
brew "broot"
brew "fontconfig"
brew "chezmoi"
brew "direnv"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "htop"
brew "jq"
brew "python@3.14"
brew "mackup"
brew "mkcert"
brew "nvm"
brew "openjdk"
brew "pkgconf"
brew "postgresql@14"
brew "ripgrep"
brew "ripsecrets"
brew "sd"
brew "shellcheck"
brew "sox"
brew "tree"
brew "wget"
brew "yadm"
brew "yq"
brew "zoxide"
brew "hashicorp/tap/vault"
brew "starkandwayne/cf/safe"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager"
cask "rectangle"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "beardedbear.beardedicons"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dwtexe.cursor-stats"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "hexsleeves.review-gate-v3"
vscode "kilocode.kilo-code"
vscode "mattpocock.ts-error-translator"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "nrwl.angular-console"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pinage404.git-extension-pack"
vscode "pkief.material-icon-theme"
vscode "prettier.prettier-vscode"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcegraph.amp"
vscode "tamasfe.even-better-toml"
vscode "traycer.traycer-vscode"
vscode "typescriptteam.native-preview"
vscode "tyriar.sort-lines"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
go "cmd/go"
go "cmd/gofmt"
go "tailscale.com/cmd/tailscale"
go "tailscale.com/cmd/tailscaled"
