tap "antoniorodr/memo"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "openhue/cli"
tap "starkandwayne/cf"
tap "steipete/tap"
tap "yakitrak/yakitrak"
brew "age"
brew "ast-grep"
brew "atuin"
brew "openssl@3"
brew "awscli"
brew "bat"
brew "bitwarden-cli"
brew "broot"
brew "fontconfig"
brew "ccusage"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "cocoapods"
brew "difftastic"
brew "direnv"
brew "docker"
brew "doggo"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fmt"
brew "fzf"
brew "gcc"
brew "python@3.14"
brew "ggshield"
brew "gh"
brew "git-cliff"
brew "git-delta"
brew "pinentry"
brew "gnupg"
brew "gnuplot"
brew "gping"
brew "gum"
brew "helm"
brew "hexyl"
brew "himalaya"
brew "htop"
brew "jq"
brew "just"
brew "kubernetes-cli"
brew "lazygit"
brew "llvm"
brew "lld"
brew "mackup"
brew "markdownlint-cli"
brew "mkcert"
brew "mosh"
brew "neovim"
brew "nvm"
brew "openai-whisper"
brew "openjdk"
brew "tree"
brew "pass"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "portaudio"
brew "postgresql@14"
brew "python@3.11"
brew "redis"
brew "ripgrep"
brew "ripsecrets"
brew "rust"
brew "sd"
brew "sdl3"
brew "shellcheck"
brew "sox"
brew "starship"
brew "swift-format"
brew "tealdeer"
brew "terraform"
brew "tmux"
brew "topgrade"
brew "vcpkg"
brew "wget"
brew "xh"
brew "yadm"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "antoniorodr/memo/memo"
brew "gromgit/fuse/sshfs-mac"
brew "hashicorp/tap/vault"
brew "openhue/cli/openhue-cli"
brew "starkandwayne/cf/safe"
brew "steipete/tap/bird"
brew "steipete/tap/gifgrep"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/imsg"
brew "steipete/tap/ordercli", link: false
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/songsee"
brew "steipete/tap/summarize"
brew "steipete/tap/wacli"
brew "yakitrak/yakitrak/obsidian-cli"
cask "1password-cli"
cask "codexbar"
cask "dotnet-sdk"
cask "expo-orbit"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "git-credential-manager"
cask "godot"
cask "godot-mono"
cask "iterm2"
cask "love"
cask "rectangle"
cask "visual-studio-code"
go "cmd/go"
go "cmd/gofmt"
go "tailscale.com/cmd/tailscale"
go "tailscale.com/cmd/tailscaled"
