# ============================================================
# Canonical Brewfile
# Single source of truth — used by both ansible and chezmoi.
# Managed in: ansible-dotfiles/roles/packages/files/Brewfile
# ============================================================

# ── Taps ─────────────────────────────────────────────────────
tap "antoniorodr/memo"
tap "boldsoftware/tap"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "openhue/cli"
tap "starkandwayne/cf"
tap "steipete/tap"
tap "veirt/veirt"
tap "yakitrak/yakitrak"

# ── Cross-platform CLI tools ─────────────────────────────────
brew "act"
brew "age"
brew "arp-scan"
brew "ast-grep"
brew "atuin"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bitwarden-cli"
brew "bottom"
brew "broot"
brew "btop"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "difftastic"
brew "direnv"
brew "doggo"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "ggshield"
brew "gh"
brew "git-cliff"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "gnuplot"
brew "gping"
brew "gum"
brew "hexyl"
brew "himalaya"
brew "htop"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "kondo"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "markdownlint-cli"
brew "mise"
brew "mkcert"
brew "mosh"
brew "neovim"
brew "ollama"
brew "openssl@3"
brew "pass"
brew "pinentry"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "ripgrep"
brew "ripsecrets"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "starship"
brew "stylua"
brew "tailscale"
brew "tealdeer"
brew "terraform", link: false
brew "tfenv"
brew "tmux"
brew "tokei"
brew "topgrade"
brew "tree"
brew "watchexec"
brew "wget"
brew "xh"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh"

# ── Tapped formulas ──────────────────────────────────────────
brew "antoniorodr/memo/memo"
brew "gromgit/fuse/sshfs-mac"
brew "hashicorp/tap/vault"
brew "openhue/cli/openhue-cli"
brew "starkandwayne/cf/safe"
brew "steipete/tap/bird"
brew "steipete/tap/gifgrep"
brew "steipete/tap/goplaces"
brew "steipete/tap/gogcli"
brew "steipete/tap/imsg"
brew "steipete/tap/ordercli", link: false
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/songsee"
brew "steipete/tap/summarize"
brew "steipete/tap/wacli"
brew "veirt/veirt/weathr"
brew "yakitrak/yakitrak/obsidian-cli"

# ── Linux-only ────────────────────────────────────────────────
if RUBY_PLATFORM.include?("linux")
  brew "fontconfig"
  brew "lld"
  brew "luarocks"
  brew "openjdk"
  brew "portaudio"
  brew "postgresql@18"
  brew "redis"
  brew "sdl3"
  brew "sox"
  brew "wl-clipboard"
end

# ── macOS-only ────────────────────────────────────────────────
if RUBY_PLATFORM.include?("darwin")
  brew "cocoapods"
  brew "docker"
  brew "libimobiledevice"
  brew "llvm"
  brew "pinentry-mac"
  brew "swift-format"
  brew "xcodegen"

  # Casks
  cask "1password-cli"
  cask "cursor"
  cask "codexbar"
  cask "dotnet-sdk"
  cask "font-caskaydia-cove-nerd-font"
  cask "font-fira-code"
  cask "font-fira-code-nerd-font"
  cask "font-jetbrains-mono-nerd-font"
  cask "gcloud-cli"
  cask "git-credential-manager"
  cask "iterm2"
  cask "orbstack"
  cask "pgadmin4"
  cask "raycast"
  cask "rectangle"
  cask "zed"

  # Tapped casks
  cask "boldsoftware/tap/shelley"
  cask "boldsoftware/tap/sketch"
  cask "steipete/tap/codexbar"
end
